# round重點是四捨五入 - 整數
# also can specify decimal place
# round() whole number
# round(value, decimal_place)

In [3]:
import mysql.connector as sql
import pandas as pd

# auth_plugin is needed, can check by commends 
# SELECT user,authentication_string,plugin,host FROM mysql.user;
# check the columns plugin and user

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    database = "sql_intro",
    buffered = True             # Unread result found issue
)                                              # if using pandas no need to use buffer

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f454c1b4820>

# round()

In [4]:

#! 四捨五入100 到小數點二位
#!  遇到整數會出現此問題要用formart(Bigquery)指定小數點比較保險

sql_query = """
SELECT 
            ROUND(100,2)
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

   ROUND(100,2)
0           100

In [5]:

#! 四捨五入100 到小數點二位
#!  遇到整數會出現此問題要用formart(Bigquery)指定小數點比較保險
#!                                                      TRUNCATE(Mysql)
#!                                                      TRUNC(Bigquery)
sql_query = """
SELECT TRUNCATE(2.465,1);
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

   TRUNCATE(2.465,1)
0                2.4

In [6]:
# find the average age of each dept.
# make avg_age has 2 decimal places
sql_query = """
SELECT dept , round(avg(age), 2) as avg_age
FROM employees
GROUP BY dept;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

                    dept  avg_age
0              Marketing    42.75
1                     PR    41.00
2                Finance    39.33
3                     IT    37.60
4  Operations management    42.67
5         Human Resource    52.00

In [7]:
# find the average age of each dept.
# make avg_age has 2 decimal places
#! in default round() has no decimals 
sql_query = """
SELECT dept , round(avg(age)) as avg_age
FROM employees
GROUP BY dept;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

                    dept  avg_age
0              Marketing     43.0
1                     PR     41.0
2                Finance     39.0
3                     IT     38.0
4  Operations management     43.0
5         Human Resource     52.0

In [8]:
# in workbench
# in default round()
# is no decimal 
#!  its coz of panda dataframe

sql_query = """
select dept, round(avg(age)) as avg_age
from employees
group by dept;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

                    dept  avg_age
0              Marketing     43.0
1                     PR     41.0
2                Finance     39.0
3                     IT     38.0
4  Operations management     43.0
5         Human Resource     52.0

In [9]:
# wo using panda
# then avg() has no decimal place
cursor = mydb.cursor()
sql_query = """
select dept, round(avg(age)) as avg_age
from employees
group by dept;
"""
# execute sql query
cursor.execute(sql_query)

#using for loop for reading data
for x in cursor:
    #print(type(x))
    print(x)   #<class 'tuple'>

('Marketing', Decimal('43'))
('PR', Decimal('41'))
('Finance', Decimal('39'))
('IT', Decimal('38'))
('Operations management', Decimal('43'))
('Human Resource', Decimal('52'))

In [11]:
# in workbench
# in default round()
# is no decimal 
#!  its coz of panda dataframe

sql_query = """
select
round(123.456)
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

   round(123.456)
0           123.0

In [12]:
# in workbench
# in default round()
# is no decimal 
#!  its coz of panda dataframe

sql_query = """
select
round(123.56)
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

   round(123.56)
0          124.0